app/views/songs/show.html.erb

	<% for person in @songlists %>
	<% if person.user.first_name == @user.first_name %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]