app/controllers/songs_controller.rb

  def index
  	@user = User.find(session[:logged_in_user])
  	@songs = Music.all.reverse
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "musics".* FROM "musics"

  def add
  	@user = User.find(session[:logged_in_user])
  	Music.create(
  		artist: params[:artist],
  		title: params[:title],
  		user: @user,
  		play: 0)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "musics" ("artist", "title", "play", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["artist", "Michael Jackson"], ["title", "Thriller"], ["play", 0], ["user_id", 1], ["created_at", 2017-02-22 23:04:44 UTC], ["updated_at", 2017-02-22 23:04:44 UTC]]

  def show
  	@song = Music.find(params[:id])
  	@user = User.find(session[:logged_in_user])
  	@other_users = User.where.not(id: @user.id)
  	@songlists = Songlist.where(music_id: @song.id)
---
SELECT  "musics".* FROM "musics" WHERE "musics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE ("users"."id" != ?) AND "users"."song_id" = ?  [["id", 2], ["song_id", 1]]
SELECT "songlists".* FROM "songlists" WHERE "songlists"."music_id" = ?  [["music_id", 1]]

  def add_to_playlist
  	@user = User.find(session[:logged_in_user])
  	@times_played = Songlist.find_by(user_id: @user.id, music_id: params[:id])
  	@song = Music.find(params[:id])

  	puts '*'*50
  	puts @song.play
  	puts '*'*50
  	if @song.play == 0
  		@plays = 1
  		Songlist.create(
  	   	user_id: @user.id,
  	   	music_id: params[:id],
  	   	play: @plays)
  	else
  		@plays = @times_played.play
  	 	@plays += 1
		@times_played.update(
			play: @plays)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "songlists".* FROM "songlists" WHERE "songlists"."user_id" = ? AND "songlists"."song_id" = ? LIMIT ?  [["user_id", 1], ["song_id", "1"], ["LIMIT", 1]]
SELECT  "musics".* FROM "musics" WHERE "musics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "songlists" ("user_id", "music_id", "created_at", "updated_at", "play") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["music_id", 1], ["created_at", 2017-02-22 23:22:17 UTC], ["updated_at", 2017-02-22 23:22:17 UTC], ["play", 0]]
UPDATE "musics" SET "play" = ?, "updated_at" = ? WHERE "musics"."id" = ?  [["play", 1], ["updated_at", 2017-02-22 23:07:52 UTC], ["id", 1]]
UPDATE "songlists" SET "play" = ?, "updated_at" = ? WHERE "songlists"."id" = ?  [["play", 1], ["updated_at", 2017-02-22 23:44:50 UTC], ["id", 5]]