app/controllers/users_controller.rb

  def login
  	if User.any?{|b| b[:email] == params[:email]}
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "shovit.kandel@gmail.com"], ["LIMIT", 1]]

  def register
  	@user = User.new(
  		first_name: params[:first_name],
  		last_name: params[:last_name],
  		email: params[:email],
  		password: params[:pw],
  		)
  	if @user.valid? == false
  		flash[:error] = @user.errors.messages
  		redirect_to '/'
  	else
  		if params[:pw]!=params[:confirm_pw]
  			flash[:pw_error] = "Passwords must be same"
  			redirect_to '/'
  		else
  			@user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def show
    @user = User.find(params[:id])
    @songlists = Songlist.where(user_id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "songlists".* FROM "songlists" WHERE "songlists"."user_id" = ?  [["user_id", 2]]